psql -h pg -d ucheb

-- запрос 1
SELECT О."ПРИМЕЧАНИЕ", В."ДАТА"
FROM "Н_ОЦЕНКИ" О
         INNER JOIN "Н_ВЕДОМОСТИ" В ON О."ПРИМЕЧАНИЕ" = В."ОЦЕНКА"
WHERE О."ПРИМЕЧАНИЕ" = 'неявка'
  AND В."ДАТА" < '1998-01-05';

-- запрос 2
-- Хз Хз Хз
SELECT Л."ФАМИЛИЯ", В."ИД", С."ДАТА"
FROM "Н_ЛЮДИ" Л
    LEFT JOIN "Н_ВЕДОМОСТИ" В on Л."ИД" = В."ЧЛВК_ИД"
    LEFT JOIN "Н_СЕССИЯ" С on Л."ИД" = С."ЧЛВК_ИД"
WHERE Л."ИД" = 100012
  AND В."ИД" = 1250981
  AND С."ИД" > 32199;

-- запрос 3
SELECT "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ",
       "Н_ЛЮДИ"."ФАМИЛИЯ",
       "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ" FROM "Н_УЧЕНИКИ"
INNER JOIN "Н_ПЛАНЫ" on "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
INNER JOIN "Н_ОТДЕЛЫ" on "Н_ПЛАНЫ"."ОТД_ИД" = "Н_ОТДЕЛЫ"."ИД"
INNER JOIN "Н_ЛЮДИ" on "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE
    "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'КТиУ' AND
    (CURRENT_TIMESTAMP - "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ") > (interval '365 days' * 25);

SELECT "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ",
       "Н_ЛЮДИ"."ФАМИЛИЯ",
       "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ" FROM "Н_УЧЕНИКИ"
                                         INNER JOIN "Н_ПЛАНЫ" on "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
                                         INNER JOIN "Н_ОТДЕЛЫ" on "Н_ПЛАНЫ"."ОТД_ИД" = "Н_ОТДЕЛЫ"."ИД"
                                         INNER JOIN "Н_ЛЮДИ" on "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE
        "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'КТиУ' AND
        age("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ") > interval '25 years';



-- запрос 4


-- запрос 5

SELECT Н_УЧЕНИКИ.ЧЛВК_ИД, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ОТЧЕСТВО,
AVG(substring(Н_ВЕДОМОСТИ.ОЦЕНКА from '^\d+')::int)
FROM Н_УЧЕНИКИ JOIN Н_ЛЮДИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
JOIN Н_ВЕДОМОСТИ USING(ЧЛВК_ИД)
WHERE Н_УЧЕНИКИ.ГРУППА = '4100'
GROUP BY 1,2,3,4
HAVING AVG(substring(Н_ВЕДОМОСТИ.ОЦЕНКА from '^\d+')::int) < (
SELECT AVG(substring(Н_ВЕДОМОСТИ.ОЦЕНКА from '^\d+')::int) FROM
Н_ВЕДОМОСТИ
JOIN Н_УЧЕНИКИ USING(ЧЛВК_ИД)
WHERE Н_УЧЕНИКИ.ГРУППА = '3100'
);


-- запрос 6
-- здесь нужен EXISTS
SELECT Н_УЧЕНИКИ.ГРУППА, Н_УЧЕНИКИ.ЧЛВК_ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО
FROM Н_УЧЕНИКИ
JOIN Н_ЛЮДИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
WHERE EXISTS (SELECT ИД FROM Н_ФОРМЫ_ОБУЧЕНИЯ
WHERE Н_УЧЕНИКИ.ПРИЗНАК='отчисл' AND Н_ПЛАНЫ.ФО_ИД = 1
AND Н_ПЛАНЫ.НАПС_ИД = 2700 AND Н_УЧЕНИКИ.КОНЕЦ = '1.9.2012');

-- запрос 7
SELECT "ИД",
       "ФАМИЛИЯ",
       "ИМЯ",
       "ОТЧЕСТВО"
FROM "Н_ЛЮДИ" AS people
WHERE NOT EXISTS(SELECT *
                 FROM "Н_УЧЕНИКИ"
                          JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
                          JOIN "Н_ОТДЕЛЫ" ON "Н_ПЛАНЫ"."ОТД_ИД" = "Н_ОТДЕЛЫ"."ИД" AND
                                             "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'КТиУ'
                          JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
                 WHERE "Н_УЧЕНИКИ"."ЧЛВК_ИД" = people."ИД");
